<template>
  <div id="main">
    <nav-bar>
      <span class="el-icon-arrow-left" slot="left" @click="lastTick()"></span>
      <span slot="center">糖尿病的疾病知识指导</span>
    </nav-bar>
    <div class="main-body">
      <div class="sweet-introduce">
        <h2>一.什么是糖尿病</h2>
        <p class="text">糖尿病是由遗传和环境因素相互作用引起的一组以慢性高血糖为特征的代谢异常综合征。
          因胰岛素分泌和（或）作用缺陷而引起的碳水化合物、蛋白质、脂肪、水和电解质紊乱。
          随着病程的延长，可出现心、脑、肾、视网膜等多脏器损害，病情恶化时可出现酮症酸中毒、高血糖高渗状态等急性并发症。</p>
      </div>
      <div class="sweet-reason">
        <h2>二.糖尿病的病因有哪些</h2>
        <p class="text">糖尿病的病因至今尚未完全阐明，引起糖尿病的病因主要为遗传因素和环境因素两大类。</p>
        <h4>1.遗传因素</h4>
        <p class="sweet-reason-text">1型或2型糖尿病均存在明显的遗传异质性。糖尿病存在家族发病倾向,1/4～1/2患者有糖尿病家族史。</p>
        <img src="@/assets/img/disease/sweet/introduce/reason_1.jpg" alt="" class="img-left">
        <img src="@/assets/img/disease/sweet/introduce/reason_2.jpg" alt="" class="img-right">
        <img src="@/assets/img/disease/sweet/introduce/reason_3.jpg" alt="" class="img" >
        <h4>2.环境因素</h4>
        <p class="text">1型糖尿病患者感染某些病毒如柯萨奇病毒，风疹病毒，腮腺病毒等后可启动自身免疫反应，导致胰岛素B细胞破坏。进食过多，体力活动不足导致的肥胖是2型糖尿病最主要的环境因素，使具有2型糖尿病遗传易感性的个体容易发病。</p>
        <img src="@/assets/img/disease/sweet/introduce/reason_4.jpg" alt="" class="img" style="height: 250px">
      </div>
      <div class="sweet-performance">
        <h2>三.糖尿病有哪些临床表现</h2>
        <p class="text">1型糖尿病发病年龄通常小于30岁，起病迅速，体重明显减轻或体型消瘦，常有自发酮症。多数病人起病初期都需要胰岛素治疗。</p>
        <p class="text">2型糖尿病可发生在任何年龄，多见于40岁以上成人和老年人，但近年来发病趋向低龄化，多数起病隐匿，症状相对较轻，半数以上病人可长期无任何症状，常在体检时发现高血糖。</p>
        <h3>1.代谢紊乱症状群</h3>
        <b>（1）多尿、多饮、多食和体重减轻</b>
        <p class="text">由于血糖升高引起渗透性利尿导致尿量增多；多尿导致失水，病人口渴而多饮；由于机体不能利用葡萄糖，且蛋白质和脂肪消耗增加，引起消瘦、疲乏、体重减轻；为补充糖分，维持机体活动，病人常易饥多食。故糖尿病的临床表现常被描述为“三多一少”（多尿、多饮、多食和体重减轻），常见于1型糖尿病病人。</p>
        <img src="@/assets/img/disease/sweet/introduce/performance_1.png" alt="" class="img">
        <p class="text">（2）皮肤瘙痒  由于高血糖及末梢神经病变导致皮肤干燥和感觉异常，病人常有皮肤瘙痒。女性病人可因尿糖刺激局部皮肤，出现外阴瘙痒。</p>
        <p class="text">（3）其他症状  四肢酸痛、麻木，腰痛、性欲减退、阳痿不育、月经失调、便秘、视力模糊等。</p>
        <img src="@/assets/img/disease/sweet/introduce/performance_2.png" alt="" class="img">
        <h3>2.并发症</h3>
        <b>（1）糖尿病急性并发症</b>
        <h4>1）糖尿病酮症酸中毒</h4>
        <p class="text">1型糖尿病病人有自发糖尿病酮症酸中毒倾向，2型糖尿病病人在一定诱因作用下也可发生，常见的诱因有急性感染、胰岛素不适当减量或突然中断治疗、饮食不当、胃肠疾病、精神刺激等。早期主要表现为乏力和“三多一少”症状加重。随后出现食欲减退、恶心、呕吐，常伴头痛、嗜睡、烦躁、呼吸深快有烂苹果味。随着病情进一步发展，出现严重失水，尿量减少、皮肤弹性差、眼球下陷、脉搏细速、血压下降、四肢厥冷，甚至昏迷。</p>
        <h4>2）高渗高血糖综合征</h4>
        <p class="text">常见诱因包括急性感染、外伤、手术、脑血管意外等应激状态，使用糖皮质激素、利尿药、甘露醇等药物，水摄入不足或失水，透析治疗，静脉高营养等。起病缓慢，最初表现为多尿、多饮，但多食不明显或反而食欲减退。随病程进展逐渐出现严重脱水和神经精神症状，病人表现为反应迟钝、烦躁或淡漠、嗜睡、定向力障碍等。晚期逐渐陷入昏迷、抽搐、尿少甚至尿闭，无酸中毒样深大呼吸。失水严重，神经精神症状突出。</p>
        <h4> 3）糖尿病乳酸酸中毒</h4>
        <p class="text">发病率较低，但病死率很高。大多发生在伴有肝、肾功能不全或慢性心肺功能不全等缺氧性疾病的病人，也常见于服用苯乙双胍者。表现为疲乏无力、厌食、恶心或呕吐、呼吸深大、嗜睡等，酸中毒表现明显。血、尿酮体不升高，血乳酸水平升高。</p>
        <h3>（2）感染 </h3>
        <p class="text">糖尿病病人代谢紊乱，导致机体抵抗力下降，因而极易感染。感染常导致难以控制的高血糖，而高血糖进一步加重感染，形成一个恶性循环。泌尿系统感染最常见，如肾盂肾炎和膀胱炎，真菌性阴道炎也常见于女性病人。常出现皮肤化脓性感染如疖、痈。</p>
        <h3>（3）糖尿病慢性并发症</h3>
        <h4>1）糖尿病大血管病变</h4>
        <p class="text">是糖尿病最严重和突出的并发症，主要表现为动脉粥样硬化，可引起冠心病、缺血性脑血管病、高血压、下肢血管病变等。</p>
        <img src="@/assets/img/disease/sweet/introduce/performance_3.jpg" alt="" class="img">
        <h4>2）糖尿病微血管病变</h4>
        <p class="text">发生微血管病变与糖尿病病程长、血糖控制不良、高血压、血脂异常、吸烟、胰岛素抵抗、遗传等因素有关。主要表现在视网膜、肾脏，糖尿病病人中有40%～60%发生糖尿病肾病，是1型糖尿病的主要死因，在2型糖尿病中的严重性仅次于心、脑血管疾病。</p>
        <p class="text">糖尿病视网膜病变是糖尿病病人失明的主要原因之一，除视网膜病变外，糖尿病还可引起黄斑病、白内障、青光眼、屈光改变、缺血性视神经病变等。</p>
        <h4>3）糖尿病神经病变</h4>
        <p class="text">糖尿病周围神经病变最常见的类型是远端对称性多发性神经病变，典型表现呈手套或袜套样对称分布，下肢较上肢严重。病人常先出现肢端感觉异常（麻木、烧灼、针刺感或踩棉花感），有时伴痛觉过敏；随后有肢体疼痛，呈隐痛、刺痛，夜间及寒冷季节加重；后期感觉丧失，累及运动神经，可有手足小肌群萎缩，出现感觉性共济失调及神经性关节病等。</p>
        <h4>（4）糖尿病足</h4>
        <p class="text">糖尿病足是糖尿病最严重的慢性并发症之一，重者可导致截肢。常见诱因有：搔抓趾间或足部皮肤而致皮肤溃破、水疱破裂、烫伤、碰撞伤、修脚损伤及新鞋磨破伤等。轻者主要临床表现为足部畸形、皮肤干燥和发凉、酸麻、疼痛等，重者可出现足部溃疡与坏疽。</p>
        <img src="@/assets/img/disease/sweet/introduce/performance_4.jpg" alt="" class="img">
        <h3>3.低血糖症</h3>
        <p class="text">对于非糖尿病病人来说，低血糖的诊断标准为血糖低于2.8mmol/L,而糖尿病病人只要血糖水平≤3.9mmol/L就属于低血糖范畴。出现低血糖的诱因常为未按时进食或进食过少；运动量增加；酒精摄入，尤其是空腹饮酒等。临床表现具体可分为两类：①交感神经兴奋：多有肌肉颤抖、心悸、出汗、饥饿感、软弱无力、紧张、焦虑、流涎、面色苍白、心率加快、四肢冰冷等。②中枢神经症状：初期为精神不集中、思维和语言迟钝、头晕、嗜睡、视物不清、步态不稳，后可有幻觉、躁动、易怒、性格改变、认知障碍，严重时发生抽搐、昏迷。</p>
        <img src="@/assets/img/disease/sweet/introduce/performance_5.png" alt="" class="img">
      </div>
    </div>
  </div>
</template>

<script>
  import NavBar from "@/components/common/navbar/NavBar";
  import '@/assets/css/main.css'
  export default {
    name: "sweetKnowledge",
    components: {
      NavBar
    },
    methods: {
      lastTick() {
        this.$router.push('/sweet')
      }
    }
  }
</script>

<style scoped>
  h4 {
    margin-left: 5%;
  }
</style>